### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.mcp_server.aws_api_gateway_deployment.mcp_server must be replaced
+/- resource "aws_api_gateway_deployment" "mcp_server" {
      ~ created_date = "2025-12-03T10:58:17Z" -> (known after apply)
      ~ id           = "xgf6ce" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "09a2fe4f34be9447fa5df0faa97936b6c5066a7b"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.mcp_server.aws_api_gateway_integration.bedrock_ask will be created
  + resource "aws_api_gateway_integration" "bedrock_ask" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "93ktku3nye"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:225903103583:function:dx-p-euc1-mcp-server-lambda-01/invocations"
    }

  # module.mcp_server.aws_api_gateway_integration.bedrock_search will be created
  + resource "aws_api_gateway_integration" "bedrock_search" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "93ktku3nye"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:225903103583:function:dx-p-euc1-mcp-server-lambda-01/invocations"
    }

  # module.mcp_server.aws_api_gateway_method.ask will be created
  + resource "aws_api_gateway_method" "ask" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "eu-central-1"
      + request_parameters = {
          + "method.request.header.Content-Type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "93ktku3nye"
    }

  # module.mcp_server.aws_api_gateway_method.search will be created
  + resource "aws_api_gateway_method" "search" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "eu-central-1"
      + request_parameters = {
          + "method.request.header.Content-Type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "93ktku3nye"
    }

  # module.mcp_server.aws_api_gateway_resource.ask will be created
  + resource "aws_api_gateway_resource" "ask" {
      + id          = (known after apply)
      + parent_id   = "k7gjvw9aek"
      + path        = (known after apply)
      + path_part   = "ask"
      + region      = "eu-central-1"
      + rest_api_id = "93ktku3nye"
    }

  # module.mcp_server.aws_api_gateway_resource.search will be created
  + resource "aws_api_gateway_resource" "search" {
      + id          = (known after apply)
      + parent_id   = "k7gjvw9aek"
      + path        = (known after apply)
      + path_part   = "search"
      + region      = "eu-central-1"
      + rest_api_id = "93ktku3nye"
    }

  # module.mcp_server.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "xgf6ce" -> (known after apply)
        id                    = "ags-93ktku3nye-prod"
        tags                  = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mcp_server.aws_iam_policy.lambda_bedrock_access will be updated in-place
  ~ resource "aws_iam_policy" "lambda_bedrock_access" {
        id               = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-bedrock-access-policy-01"
        name             = "dx-p-euc1-lambda-bedrock-access-policy-01"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "bedrock:Retrieve",
                          + "bedrock:RetrieveAndGenerate",
                        ]
                      ~ Resource = "arn:aws:bedrock:eu-central-1:225903103583:knowledge-base/ALSBZAYABZ" -> [
                          + "arn:aws:bedrock:eu-central-1:225903103583:knowledge-base/ALSBZAYABZ",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "bedrock:InvokeModel",
                          + "bedrock:GetInferenceProfile",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:bedrock:eu-central-1:225903103583:inference-profile/eu.amazon.nova-2-lite-v1:0",
                          + "arn:aws:bedrock:eu-*::foundation-model/amazon.nova-2-lite-v1:0",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)
    }

  # module.mcp_server.aws_iam_policy.lambda_ssm_read_access will be destroyed
  # (because aws_iam_policy.lambda_ssm_read_access is not in configuration)
  - resource "aws_iam_policy" "lambda_ssm_read_access" {
      - arn              = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-ssm-read-access-policy-01" -> null
      - attachment_count = 1 -> null
      - description      = "IAM policy for Lambda to read all ssm parameters that start with /mcpserver/" -> null
      - id               = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-ssm-read-access-policy-01" -> null
      - name             = "dx-p-euc1-lambda-ssm-read-access-policy-01" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                          - "ssm:GetParametersByPath",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-central-1:225903103583:parameter/mcpserver/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATJGG7ZZPSBK2DJ64K" -> null
      - tags             = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
      - tags_all         = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.mcp_server.aws_iam_role_policy_attachment.lambda_ssm_read_access will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_ssm_read_access is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_ssm_read_access" {
      - id         = "dx-p-euc1-lambda-mcp-server-role-01/arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-ssm-read-access-policy-01" -> null
      - policy_arn = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-ssm-read-access-policy-01" -> null
      - role       = "dx-p-euc1-lambda-mcp-server-role-01" -> null
    }

  # module.mcp_server.aws_lambda_function.server will be updated in-place
  ~ resource "aws_lambda_function" "server" {
        id                             = "dx-p-euc1-mcp-server-lambda-01"
        tags                           = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "BEDROCK_MODEL_ARN"                     = "arn:aws:bedrock:eu-central-1:225903103583:inference-profile/eu.amazon.nova-2-lite-v1:0"
              - "GITHUB_CLIENT_ID_SSM_PARAM"            = "/mcpserver/mcp-github-client-id" -> null
              - "GITHUB_CLIENT_SECRET_SSM_PARAM"        = "/mcpserver/mcp-github-client-secret" -> null
              - "LOG_LEVEL"                             = "info" -> null
              - "MCP_AUTH_TYPE"                         = "oauth" -> null
              - "MCP_SERVER_URL"                        = "https://api.dx.pagopa.it" -> null
                # (3 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.mcp_server.aws_ssm_parameter.github_client_id will be destroyed
  # (because aws_ssm_parameter.github_client_id is not in configuration)
  - resource "aws_ssm_parameter" "github_client_id" {
      - arn             = "arn:aws:ssm:eu-central-1:225903103583:parameter/mcpserver/mcp-github-client-id" -> null
      - data_type       = "text" -> null
      - description     = "GitHub OAuth Client ID for MCP Server" -> null
      - has_value_wo    = false -> null
      - id              = "/mcpserver/mcp-github-client-id" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/mcpserver/mcp-github-client-id" -> null
      - region          = "eu-central-1" -> null
      - tags            = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
      - tags_all        = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 2 -> null
        # (1 unchanged attribute hidden)
    }

  # module.mcp_server.aws_ssm_parameter.github_client_secret will be destroyed
  # (because aws_ssm_parameter.github_client_secret is not in configuration)
  - resource "aws_ssm_parameter" "github_client_secret" {
      - arn             = "arn:aws:ssm:eu-central-1:225903103583:parameter/mcpserver/mcp-github-client-secret" -> null
      - data_type       = "text" -> null
      - description     = "GitHub OAuth Client Secret for MCP Server" -> null
      - has_value_wo    = false -> null
      - id              = "/mcpserver/mcp-github-client-secret" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/mcpserver/mcp-github-client-secret" -> null
      - region          = "eu-central-1" -> null
      - tags            = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
      - tags_all        = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 2 -> null
        # (1 unchanged attribute hidden)
    }

  # module.mcp_registry.module.portal.azurerm_cdn_frontdoor_endpoint.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "this" {
        id                       = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.Cdn/profiles/dx-p-weu-mcp-registry-afd-01/afdEndpoints/dx-p-weu-mcp-registry-fde-01"
        name                     = "dx-p-weu-mcp-registry-fde-01"
      ~ tags                     = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.3.3"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.mcp_registry.module.portal.azurerm_cdn_frontdoor_profile.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "this" {
        id                       = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.Cdn/profiles/dx-p-weu-mcp-registry-afd-01"
        name                     = "dx-p-weu-mcp-registry-afd-01"
      ~ tags                     = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.3.3"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mcp_registry.module.portal.azurerm_dns_cname_record.this["mcp.dx.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-network-rg-01/providers/Microsoft.Network/dnsZones/dx.pagopa.it/CNAME/mcp"
        name                = "mcp"
      ~ tags                = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.3.3"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)
    }

  # module.mcp_registry.module.portal.azurerm_dns_txt_record.validation["mcp.dx.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "validation" {
        id                  = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-network-rg-01/providers/Microsoft.Network/dnsZones/dx.pagopa.it/TXT/_dnsauth.mcp"
        name                = "_dnsauth.mcp"
      ~ tags                = {
            "Cdn"            = "dx-p-weu-mcp-registry-afd-01"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.3.3"
            "Origin"         = "mcp.dx.pagopa.it"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 7 to change, 5 to destroy.

Warning: Argument is deprecated

  with module.mcp_registry.module.portal.azurerm_monitor_diagnostic_setting.diagnostic_settings_cdn_profile,
  on .terraform/modules/mcp_registry.portal/cdn.tf line 76, in resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings_cdn_profile":
  76: resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings_cdn_profile" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and one more similar warning elsewhere)
```

</details>
